nxp-mcuxpresso/sbl/target/evkmimxrt600/device/MIMXRT685S/drivers/fsl_sctimer.c
    if ((0U != pwmParams->dutyCyclePercent) && ((s_currentEvent + 2U) <= (uint32_t)FSL_FEATURE_SCT_NUMBER_OF_EVENTS))
    {
        /* Use bi-directional mode for center-aligned PWM */
        if (mode == kSCTIMER_CenterAlignedPwm)
        {
            base->CTRL |= SCT_CTRL_BIDIR_L_MASK;
        }

        /* Calculate PWM period match value */
        if (mode == kSCTIMER_EdgeAlignedPwm)
        {
            period = (sctClock / pwmFreq_Hz) - 1U;
        }
        else
        {
            period = sctClock / (pwmFreq_Hz * 2U);
        }

        /* Calculate pulse width match value */
        pulsePeriod = (period * pwmParams->dutyCyclePercent) / 100U;

        /* For 100% dutycyle, make pulse period greater than period so the event will never occur */
        if (pwmParams->dutyCyclePercent >= 100U)
        {
            pulsePeriod = period + 2U;
        }

        /* Schedule an event when we reach the PWM period */
        status =
            SCTIMER_CreateAndScheduleEvent(base, kSCTIMER_MatchEventOnly, period, 0, kSCTIMER_Counter_U, &periodEvent);

        /* Schedule an event when we reach the pulse width */
        status2 = SCTIMER_CreateAndScheduleEvent(base, kSCTIMER_MatchEventOnly, pulsePeriod, 0, kSCTIMER_Counter_U,
                                                 &pulseEvent);

        if ((kStatus_Success == status) && (kStatus_Success == status2))
        {
            /* Reset the counter when we reach the PWM period */
            SCTIMER_SetupCounterLimitAction(base, kSCTIMER_Counter_U, periodEvent);

            /* Return the period event to the user */
            *event = periodEvent;

            /* For high-true level */
            if ((uint32_t)pwmParams->level == (uint32_t)kSCTIMER_HighTrue)
            {
                /* Set the initial output level to low which is the inactive state */
                base->OUTPUT &= ~(1UL << (uint32_t)pwmParams->output);

                if (mode == kSCTIMER_EdgeAlignedPwm)
                {
                    /* Set the output when we reach the PWM period */
                    SCTIMER_SetupOutputSetAction(base, (uint32_t)pwmParams->output, periodEvent);
                    /* Clear the output when we reach the PWM pulse value */
                    SCTIMER_SetupOutputClearAction(base, (uint32_t)pwmParams->output, pulseEvent);
                }
                else
                {
                    /* Clear the output when we reach the PWM pulse event */
                    SCTIMER_SetupOutputClearAction(base, (uint32_t)pwmParams->output, pulseEvent);
                    /* Reverse output when down counting */
                    reg = base->OUTPUTDIRCTRL;
                    reg &= ~((uint32_t)SCT_OUTPUTDIRCTRL_SETCLR0_MASK << (2U * (uint32_t)pwmParams->output));
                    reg |= (1UL << (2U * (uint32_t)pwmParams->output));
                    base->OUTPUTDIRCTRL = reg;
                }
            }
            /* For low-true level */
            else
            {
                /* Set the initial output level to high which is the inactive state */
                base->OUTPUT |= (1UL << (uint32_t)pwmParams->output);

                if (mode == kSCTIMER_EdgeAlignedPwm)
                {
                    /* Clear the output when we reach the PWM period */
                    SCTIMER_SetupOutputClearAction(base, (uint32_t)pwmParams->output, periodEvent);
                    /* Set the output when we reach the PWM pulse value */
                    SCTIMER_SetupOutputSetAction(base, (uint32_t)pwmParams->output, pulseEvent);
                }
                else
                {
                    /* Set the output when we reach the PWM pulse event */
                    SCTIMER_SetupOutputSetAction(base, (uint32_t)pwmParams->output, pulseEvent);
                    /* Reverse output when down counting */
                    reg = base->OUTPUTDIRCTRL;
                    reg &= ~((uint32_t)SCT_OUTPUTDIRCTRL_SETCLR0_MASK << (2U * (uint32_t)pwmParams->output));
                    reg |= (1UL << (2U * (uint32_t)pwmParams->output));
                    base->OUTPUTDIRCTRL = reg;
                }
            }
        }
        else
        {
            status = kStatus_Fail;
        }
    }

    return status;
}

/*!
 * brief Updates the duty cycle of an active PWM signal.
 *
 * Before calling  this function, the counter is set to operate as one 32-bit counter (unify bit is set to 1).
 *
 * param base              SCTimer peripheral base address
 * param output            The output to configure
 * param dutyCyclePercent  New PWM pulse width; the value should be between 1 to 100
 * param event             Event number associated with this PWM signal. This was returned to the user by the
 *                          function SCTIMER_SetupPwm().
 */
void SCTIMER_UpdatePwmDutycycle(SCT_Type *base, sctimer_out_t output, uint8_t dutyCyclePercent, uint32_t event)

{
    assert(dutyCyclePercent > 0U);
    assert((uint32_t)output < (uint32_t)FSL_FEATURE_SCT_NUMBER_OF_OUTPUTS);
    assert(1U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));

    uint32_t periodMatchReg, pulseMatchReg;
    uint32_t pulsePeriod = 0, period;

    /* Retrieve the match register number for the PWM period */
    periodMatchReg = base->EV[event].CTRL & SCT_EV_CTRL_MATCHSEL_MASK;

    /* Retrieve the match register number for the PWM pulse period */
    pulseMatchReg = base->EV[event + 1U].CTRL & SCT_EV_CTRL_MATCHSEL_MASK;

    period = base->MATCH[periodMatchReg];

    /* Calculate pulse width match value */
    pulsePeriod = (period * dutyCyclePercent) / 100U;

    /* For 100% dutycyle, make pulse period greater than period so the event will never occur */
    if (dutyCyclePercent >= 100U)
    {
        pulsePeriod = period + 2U;
    }

    /* Stop the counter before updating match register */
    SCTIMER_StopTimer(base, kSCTIMER_Counter_U);

    /* Update dutycycle */
    base->MATCH[pulseMatchReg]    = SCT_MATCH_MATCHn_L(pulsePeriod);
    base->MATCHREL[pulseMatchReg] = SCT_MATCHREL_RELOADn_L(pulsePeriod);

    /* Restart the counter */
    SCTIMER_StartTimer(base, kSCTIMER_Counter_U);
}

/*!
 * brief Create an event that is triggered on a match or IO and schedule in current state.
 *
 * This function will configure an event using the options provided by the user. If the event type uses
 * the counter match, then the function will set the user provided match value into a match register
 * and put this match register number into the event control register.
 * The event is enabled for the current state and the event number is increased by one at the end.
 * The function returns the event number; this event number can be used to configure actions to be
 * done when this event is triggered.
 *
 * param base         SCTimer peripheral base address
 * param howToMonitor Event type; options are available in the enumeration ::sctimer_interrupt_enable_t
 * param matchValue   The match value that will be programmed to a match register
 * param whichIO      The input or output that will be involved in event triggering. This field
 *                     is ignored if the event type is "match only"
 * param whichCounter SCTimer counter to use. In 16-bit mode, we can select Counter_L and Counter_H,
 *                     In 32-bit mode, we can select Counter_U.
 * param event        Pointer to a variable where the new event number is stored
 *
 * return kStatus_Success on success
 *         kStatus_Error if we have hit the limit in terms of number of events created or
                         if we have reached the limit in terms of number of match registers
 */
status_t SCTIMER_CreateAndScheduleEvent(SCT_Type *base,
                                        sctimer_event_t howToMonitor,
                                        uint32_t matchValue,
                                        uint32_t whichIO,
                                        sctimer_counter_t whichCounter,
                                        uint32_t *event)
{
    uint32_t combMode       = (((uint32_t)howToMonitor & SCT_EV_CTRL_COMBMODE_MASK) >> SCT_EV_CTRL_COMBMODE_SHIFT);
    uint32_t currentCtrlVal = (uint32_t)howToMonitor;
    status_t status         = kStatus_Success;

    if (s_currentEvent < (uint32_t)FSL_FEATURE_SCT_NUMBER_OF_EVENTS)
    {
        if (2U == combMode)
        {
            base->EV[s_currentEvent].CTRL = currentCtrlVal | SCT_EV_CTRL_IOSEL(whichIO);
        }
        else
        {
            if ((0U == combMode) || (3U == combMode))
            {
                currentCtrlVal |= SCT_EV_CTRL_IOSEL(whichIO);
            }

            if ((kSCTIMER_Counter_L == whichCounter) || (kSCTIMER_Counter_U == whichCounter))
            {
                if (s_currentMatch < (uint32_t)FSL_FEATURE_SCT_NUMBER_OF_MATCH_CAPTURE)
                {
                    currentCtrlVal |= SCT_EV_CTRL_MATCHSEL(s_currentMatch);

                    /* Use Counter_L bits if counter is operating in 32-bit mode or user wants to setup the L counter */
                    base->MATCH_ACCESS16BIT[s_currentMatch].MATCHL       = (uint16_t)matchValue;
                    base->MATCHREL_ACCESS16BIT[s_currentMatch].MATCHRELL = (uint16_t)matchValue;
                    base->EV[s_currentEvent].CTRL                        = currentCtrlVal;

